#include <stdio.h>

void name()
{
	setlocale(LC_ALL, "RUS");
	puts("***********************************************************************************");
	puts("*                                                                                 *");
	puts("* тема: Написание и компиляция консольного приложения в среде разработки MVS 2022 *");
	puts("*                                                                                 *");
	puts("*                                  Выполнил: Карцев И.И                           *");
	puts("*                                                                                 *");
	puts("***********************************************************************************");
}
void date()
{
	puts(" _          _    _   _ ");
	puts("|_| |_|  |  _|  | | |_|");
	puts("|_|   |  | |_   |_| |_|");
}
void main()
{
	setlocale(LC_ALL, "RUS");
	puts("Нажмите Enter для продолжения");
	puts("Продолжение программы");
	getchar();
	return 0;
}