
#include <stdio.h>

int main(void)
{
	setlocale(LC_ALL, "RUS");
	puts("***********************************************************************************");
	puts("*                                                                                 *");
	puts("* тема: Написание и компиляция консольного приложения в среде разработки MVS 2022 *");
	puts("*                                                                                 *");
	puts("*                                  Выполнил: Карцев И.И                           *");
	puts("*                                                                                 *");
	puts("***********************************************************************************");
	return 0;
}
