#include <stdio.h>
#include <locale.h>

void name(void)
{
	puts("***********************************************************************************");
	puts("*                                                                                 *");
	puts("* тема: Написание и компиляция консольного приложения в среде разработки MVS 2022 *");
	puts("*                                                                                 *");
	puts("*                                  Выполнил: Карцев И.И                           *");
	puts("*                                                                                 *");
	puts("***********************************************************************************");
}

void date(void)
{
	puts(" _          _    _   _ ");
	puts("|_| |_|  |  _|  | | |_|");
	puts("|_|   |  | |_   |_| |_|");
}

int main(void)
{
	setlocale(LC_ALL, "RUS");
	name();
	date();
	puts("Нажмите Enter для продолжения");
	getchar();
	puts("Продолжение программы");
	return 0;
}
